# DGNImportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNImportOptions Constructor
DGNImportOptions Class See Also
---
Constructs a new instance of DGNImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DGNImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DGNImportOptions()
```

# See Also
DGNImportOptions Class
DGNImportOptions Overload
Autodesk.Revit.DB Namespace